PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
/**
  ******************************************************************************
  * @file    Audio/Mic_Array/Src/main.c
  * @author  Phan Le Son
  * @version V1.0.0
  * @date    12-Dec-2015 
  * @brief   Microphone Array
  ******************************************************************************

  */

/* Includes ------------------------------------------------------------------*/
#include "waveplayer.h"
#include "waverecorder.h"
#include "stm32f7xx_hal_usart.h"
#include "pdm_filter.h"
#include <stdio.h>


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/


/* I2C TIMING Register define when I2C clock source is APB1 (SYSCLK/4) */
/* I2C TIMING is calculated in case of the I2C Clock source is the APB1CLK = 50 MHz */
/* This example use TIMING to 0x40912732 to reach 100 kHz speed (Rise time = 700 ns, Fall time = 100 ns) */



#define DEBUG           0


/* Private variables ---------------------------------------------------------*/
USBH_HandleTypeDef hUSBHost;
AUDIO_ApplicationTypeDef appli_state = APPLICATION_IDLE;//APPLICATION_IDLE

I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart6;
SPI_HandleTypeDef hspi5;
GPIO_InitTypeDef GPIO_INS;

extern AUDIO_IN_BufferTypeDef Buffer1, Buffer2;
AUDIO_IN_BufferTypeDef Buffer3;


uint8_t  pI2CData[20]= {0,10,20,30,40,50,60,70,80,90,100,110,120,130,140,150,160,170,180,190};
uint8_t  pI2CRx[10];
extern uint8_t  pcSTAComnd[19];

uint16_t __IO idxSPI5DataBuf1, idxSPI5DataBuf2;
uint16_t __IO cntRisingEXTI;

/* Buffer used for reception */
uint8_t aRxBuffer[1024];


#if (DEBUG)
uint8_t  pUARTBuf[128];
#endif

/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id);
static void AUDIO_InitApplication(void);
static void CPU_CACHE_Enable(void);
static void SystemClock_Config1(void);
static uint16_t SPI_I2S_ReceiveData(SPI_TypeDef* SPIx);

void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c);
void MX_I2C1_Init(void);
void UART6_Init(void);
void MX_SPI5_Init(void);
void ReadSTASeq(uint8_t Addr, uint8_t *pBufOut,uint8_t Len );
void WriteSTAByte(uint8_t Addr, uint8_t *pBufIn, uint8_t len);
void SPI5_CallBack(SPI_HandleTypeDef *hspi);
static void SPI_I2S_SendData(SPI_TypeDef* SPIx, uint16_t Data);


char __IO flg10ms;
uint8_t flgSTAIni;


/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{

   uint8_t j;
   j=0;
  /* Enable the CPU Cache */
  CPU_CACHE_Enable();
  
  /* STM32F7xx HAL library initialization:
       - Configure the Flash ART accelerator on ITCM interface
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Global MSP (MCU Support Package) initialization
     */   
  HAL_Init();
  
  /* Configure the system clock to 216 MHz */
  SystemClock_Config(); 
  //SystemClock_Config1();

  /* Init Audio Application */
  //AUDIO_InitApplication();
    /* Configure LED1 */
  BSP_LED_Init(LED1);
  
  /* Initialize for Audio player with CS43L22 */
  WavePlayerInit(FRERAD);
  
  /* Init TS module */
  //BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());

  /* Init Host Library */
  //USBH_Init(&hUSBHost, USBH_UserProcess, 0);

  /* Add Supported Class */
  //USBH_RegisterClass(&hUSBHost, USBH_MSC_CLASS);
  
  /* Start Host Process */
  //USBH_Start(&hUSBHost);

 
  
 

   /* ----------------------*/
   __GPIOB_CLK_ENABLE();
  GPIO_INS.Pin = GPIO_PIN_4;
  GPIO_INS.Mode =GPIO_MODE_IT_RISING;
  GPIO_INS.Pull =GPIO_NOPULL;
  GPIO_INS.Speed =GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOB,&GPIO_INS);

  /* Enable and set Button EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)EXTI4_IRQn, 0x0F, 0x00);
  HAL_NVIC_EnableIRQ((IRQn_Type)EXTI4_IRQn);
  /*-----------------------*/
	

  //sop1hc
  ///////Audio_Streaming_Ini();
  /* control the STA321 */
  ///////MX_I2C1_Init(); 
  //MX_SPI5_Init();
  //HAL_Delay(10000);
  //__HAL_SPI_DISABLE(&hspi5);
  
  ////////I2S_Init();

  ////////STA321MP_Ini();	
#if (DEBUG)  
  /* UART for debug */
  UART6_Init();
#endif
  


 
  /* Run Application (Blocking mode) */
  while (1)
  {


	/* USB Host Background task */
    //USBH_Process(&hUSBHost);
    
    /* AUDIO Menu Process */
    //AUDIO_MenuProcess();



    	  //if(HAL_SPI_TransmitReceive_IT(&hspi5, (uint8_t*)&Buffer1.pcm_buff[0], (uint8_t *)aRxBuffer, 1024) != HAL_OK)
         {
            /* Transfer error in transmission process */
           //Error_Handler();
          }
    if (flg10ms==1)
    {
        flg10ms=0;
		
        //BSP_LED_Toggle(LED1);


        //HAL_SPI_Receive_IT(&hspi5,(uint8_t *)&Buffer1.pcm_buff[0],124);
	    //HAL_SPI_Receive(&hspi5,(uint8_t *)aRxBuffer,124,1000);

	    //ReadSTASeq(pI2CData[j], pI2CRx, 10);
		 

#if (DEBUG)
	     for(uint8_t i=0;i<10;i++)
	     {
		    sprintf(pUARTBuf,"Reg[ 0x%.2X ]: 0x%.2X \r\n",(pI2CData[j]+i),pI2CRx[i]);

	        while(HAL_UART_Transmit(&huart6,pUARTBuf,20,1000)!= HAL_OK)
	        {
	          ;
	        }
	     }		   
#endif

     
       j++;

       if (j==50) //50*10ms = 500 ms
       {
 

#if (DEBUG)
		 sprintf(pUARTBuf,"------------------");
		 while(HAL_UART_Transmit(&huart6,pUARTBuf,30,1000)!= HAL_OK)
	     {
	          ;
	      }
#endif
         BSP_LED_Toggle(LED1);
	   	 j=0;
                 
       }


    }
  }
  
}

/**
  * @brief  Toggle Leds.
  * @param  None
  * @retval None
  */
void Toggle_Leds(void)
{
  static uint32_t ticks = 0;

  if (ticks++ > 200)
  {
    //BSP_LED_Toggle(LED1);
    ticks = 0;
  }
}

/*******************************************************************************
                            Static Function
*******************************************************************************/

/**
  * @brief  Audio Application Init.
  * @param  None
  * @retval None
  */
static void AUDIO_InitApplication(void)
{
  /* Configure LED1 */
  BSP_LED_Init(LED1);

  /* Initialize the LCD */
  //BSP_LCD_Init();
  
  /* LCD Layer Initialization */
  //BSP_LCD_LayerDefaultInit(1, LCD_FB_START_ADDRESS); 
  
  /* Select the LCD Layer */
  //BSP_LCD_SelectLayer(1);
  
  /* Enable the display */
  //BSP_LCD_DisplayOn();
  
  /* Init the LCD Log module */
  //LCD_LOG_Init();
  
  //LCD_LOG_SetHeader((uint8_t *)"Audio Playback and Record Application");
  
  //LCD_UsrLog("USB Host library started.\n"); 
  
  /* Start Audio interface */
  //USBH_UsrLog("Starting Audio Demo");
  
  /* Init Audio interface */
  //AUDIO_PLAYER_Init();
}

/**
  * @brief  User Process
  * @param  phost: Host Handle
  * @param  id: Host Library user message ID
  * @retval None
  */
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id)
{
  switch(id)
  { 
  case HOST_USER_SELECT_CONFIGURATION:
    break;
    
  case HOST_USER_DISCONNECTION:
    appli_state = APPLICATION_DISCONNECT;
    break;

  case HOST_USER_CLASS_ACTIVE:
    appli_state = APPLICATION_READY;
    break;
 
  case HOST_USER_CONNECTION:
    appli_state = APPLICATION_START;
    break;
   
  default:
    break; 
  }
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 216000000
  *            HCLK(Hz)                       = 216000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 432
  *            PLL_P                          = 2
  *            PLL_Q                          = 9
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 7
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

